# 백준 - 브론즈3 - 과제 안 내신 분 - 5597 - 단순 구현 문제
"""
단순 구현 문제

[풀이 과정]
    - 단순히 완전 탐색으로 풀었다.
"""

n_list = [int(input()) for _ in range(28)]

# 테스트
# n_list = [
#     3, 1, 4, 5, 7, 9, 6, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30
# ] # 2  \  8
# n_list = [
#     9, 30, 6, 12, 10, 20, 21, 11, 7, 5, 28, 4, 18, 29, 17, 19, 27, 13, 16, 26, 14, 23, 22, 15, 3, 1, 24, 25
# ] # 2  \  8
num_list = [0 for _ in range(31)]

for i in n_list:
    num_list[i] += 1

for i in range(1, len(num_list)):
    if num_list[i] == 0:
        print(i)
