'''
조합, 자료 구조 문제

itertools 안에 combinations를 활용해서 문제를 풀었다.
combinations를 한 후 답을 출력한 다음에 공백 한 줄 출력을 하지 않으면 '출력형식이 잘못되었다'라는 에러가 나온다
해당 부분 조심하고 풀면 된다.

in
    7 1 2 3 4 5 6 7
    8 1 2 3 5 8 13 21 34
    0
out
    1 2 3 4 5 6
    1 2 3 4 5 7
    1 2 3 4 6 7
    1 2 3 5 6 7
    1 2 4 5 6 7
    1 3 4 5 6 7
    2 3 4 5 6 7

    1 2 3 5 8 13
    1 2 3 5 8 21
    1 2 3 5 8 34
    1 2 3 5 13 21
    1 2 3 5 13 34
    1 2 3 5 21 34
    1 2 3 8 13 21
    1 2 3 8 13 34
    1 2 3 8 21 34
    1 2 3 13 21 34
    1 2 5 8 13 21
    1 2 5 8 13 34
    1 2 5 8 21 34
    1 2 5 13 21 34
    1 2 8 13 21 34
    1 3 5 8 13 21
    1 3 5 8 13 34
    1 3 5 8 21 34
    1 3 5 13 21 34
    1 3 8 13 21 34
    1 5 8 13 21 34
    2 3 5 8 13 21
    2 3 5 8 13 34
    2 3 5 8 21 34
    2 3 5 13 21 34
    2 3 8 13 21 34
    2 5 8 13 21 34
    3 5 8 13 21 34
'''

from itertools import combinations as combi

while 1:
    n_list = list(map(int, input().split()))
    
    if len(n_list) == 1:
        break

    res = combi(n_list[1:], 6)
    for i in res:
        print(*i)
    print()
